CSI API ETABS v1

# eLength Enumeration

---

The length units that can be specified for the model.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eLength

    Public Enumeration eLength

    Dim instance As eLength

    public enum class eLength

    type eLength

Members

| Member name| Value| Description
---|---|---|---
| NotApplicable| 0|
| inch| 1|
| ft| 2|
| micron| 3|
| mm| 4|
| cm| 5|
| m| 6|

Remarks

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com